tutorials/underFreeSurface/Miller_Jasak/2D/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0    YMIN 0   )
    (XMAX YMIN ZMIN)
    (XMAX YMAX ZMIN)
    (0    YMAX 0   )
    (XMAX YMIN ZMAX)
    (XMAX YMAX ZMAX)
);

blocks
(
    hex (0 1 2 3 0 4 5 3) (NX NY 1) simpleGrading (
        ( 
            (XgrL1 XgrN1 XgrG1)    // 20% y-dir, 30% cells, expansion = 4 
            (XgrL2 XgrN2 XgrG2)    // 60% y-dir, 40% cells, expansion = 1 
        ) 
        ( 
            (YgrL1 YgrN1 YgrG1)    // 20% y-dir, 30% cells, expansion = 4 
            (YgrL2 YgrN2 YgrG2)    // 60% y-dir, 40% cells, expansion = 1 
            (YgrL3 YgrN3 YgrG3) // 20% y-dir, 30% cells, expansion = 0.25 (1/4) 
        ) 
        1)
        );

patches
(
    wall walls
    (
        (0 1 4 0)
        (1 4 5 2)
        (3 2 5 3)
    )
    symmetryPlane axis 
    (
        (0 0 3 3)
    )
    wedge front 
    (
        (0 3 2 1)
    )
    wedge back 
    (
        (0 4 5 3)
    )
);

// ************************************************************************* //
