tutorials/underFreeSurface/Miller_Jasak/2D/constant/thermophysicalProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.8954;
    }
    equationOfState
    {
        rho0       149.56;
        B          0;
        gamma      1.25;
        p0         72.7e6;
    }
    thermodynamics
    {
        Cp          2200;
        Hf          0;
    }
    transport
    {
        mu          1.e-06;
        Pr          0.7;
    }
}


// ************************************************************************* //
