tutorials/underFreeSurface/Miller_Jasak/2D/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls
    {
        //~ type            totalPressure;
        //~ p0              uniform 1.01325e5;
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        fieldInf        101325;
        gamma           7.15;
        lInf            0.5;
        value           uniform 101325;

    }

    axis
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
