tutorials/underFreeSurface/Miller_Jasak/2D/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh pD
    volScalarFieldValue p pD
    volScalarFieldValue T TD
);

regions
(
    sphereToCell
    {
        centre (XBUBBLE YBUBBLE 0);
        radius RBUBBLE;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh pB
            volScalarFieldValue p pB
            volScalarFieldValue T TB
        );
    }
    boxToCell
    {
        box ( XMIN YFREESURFACE ZMIN ) (  XMAX YMAX ZMAX ) ; 
        fieldValues
        (
            volScalarFieldValue alpha.water 0.
        );
    }
);


// ************************************************************************* //
